microchip-pic-avr-examples/dspic33ck-mchv3-sensorless-singlephase-bldc-drive/spbldc_2kg/spbldc_2kg.X/mcc_generated_files/peripheral/src/pwm.c
    // BPEN disabled; BPSEL PWM Generator 1; ACP Level-sensitive; SWPCI Drives '0'; SWPCIM PCI acceptance logic; PCIGT disabled; TQPS Not inverted; TQSS None; 
    PG6SPCIH = 0x0;
    // BPEN disabled; BPSEL PWM Generator 1; ACP Level-sensitive; SWPCI Drives '0'; SWPCIM PCI acceptance logic; PCIGT disabled; TQPS Not inverted; TQSS None; 
    PG7SPCIH = 0x0;
    // BPEN disabled; BPSEL PWM Generator 1; ACP Level-sensitive; SWPCI Drives '0'; SWPCIM PCI acceptance logic; PCIGT disabled; TQPS Not inverted; TQSS None; 
    PG8SPCIH = 0x0;
    // LEB 0x0; 
    PG1LEBL = 0x0;
    // LEB 0x0; 
    PG2LEBL = 0x0;
    // LEB 0x0; 
    PG3LEBL = 0x0;
    // LEB 0x0; 
    PG4LEBL = 0x0;
    // LEB 0x0; 
    PG5LEBL = 0x0;
    // LEB 0x0; 
    PG6LEBL = 0x0;
    // LEB 0x0; 
    PG7LEBL = 0x0;
    // LEB 0x0; 
    PG8LEBL = 0x0;
    // PWMPCI PWM1; PHR disabled; PHF disabled; PLR disabled; PLF disabled; 
    PG1LEBH = 0x0;
    // PWMPCI PWM1; PHR disabled; PHF disabled; PLR disabled; PLF disabled; 
    PG2LEBH = 0x0;
    // PWMPCI PWM1; PHR disabled; PHF disabled; PLR disabled; PLF disabled; 
    PG3LEBH = 0x0;
    // PWMPCI PWM1; PHR disabled; PHF disabled; PLR disabled; PLF disabled; 
    PG4LEBH = 0x0;
    // PWMPCI PWM1; PHR disabled; PHF disabled; PLR disabled; PLF disabled; 
    PG5LEBH = 0x0;
    // PWMPCI PWM1; PHR disabled; PHF disabled; PLR disabled; PLF disabled; 
    PG6LEBH = 0x0;
    // PWMPCI PWM1; PHR disabled; PHF disabled; PLR disabled; PLF disabled; 
    PG7LEBH = 0x0;
    // PWMPCI PWM1; PHR disabled; PHF disabled; PLR disabled; PLF disabled; 
    PG8LEBH = 0x0;
    // PHASE1 0x0; 
    PG1PHASE = 0x0;
    // PHASE2 0x0; 
    PG2PHASE = 0x0;
    // PHASE3 0x0; 
    PG3PHASE = 0x0;
    // PHASE4 0x0; 
    PG4PHASE = 0x0;
    // PHASE5 0x0; 
    PG5PHASE = 0x0;
    // PHASE6 0x0; 
    PG6PHASE = 0x0;
    // PHASE7 0x0; 
    PG7PHASE = 0x0;
    // PHASE8 0x0; 
    PG8PHASE = 0x0;
    // DC1 0x0; 
    PG1DC = 0x0;
    // DC2 0x0; 
    PG2DC = 0x0;
    // DC3 0x0; 
    PG3DC = 0x0;
    // DC4 0x0; 
    PG4DC = 0x0;
    // DC5 0x0; 
    PG5DC = 0x0;
    // DC6 0x0; 
    PG6DC = 0x0;
    // DC7 0x0; 
    PG7DC = 0x0;
    // DC8 0x0; 
    PG8DC = 0x0;
    // DCA1 0x0; 
    PG1DCA = 0x0;
    // DCA2 0x0; 
    PG2DCA = 0x0;
    // DCA3 0x0; 
    PG3DCA = 0x0;
    // DCA4 0x0; 
    PG4DCA = 0x0;
    // DCA5 0x0; 
    PG5DCA = 0x0;
    // DCA6 0x0; 
    PG6DCA = 0x0;
    // DCA7 0x0; 
    PG7DCA = 0x0;
    // DCA8 0x0; 
    PG8DCA = 0x0;
    // PER1 0x0; 
    PG1PER = 0x0;
    // PER2 0x0; 
    PG2PER = 0x0;
    // PER3 0x0; 
    PG3PER = 0x0;
    // PER4 0x0; 
    PG4PER = 0x0;
    // PER5 0x0; 
    PG5PER = 0x0;
    // PER6 0x0; 
    PG6PER = 0x0;
    // PER7 0x0; 
    PG7PER = 0x0;
    // PER8 0x0; 
    PG8PER = 0x0;
    // TRIGA1 0x0; 
    PG1TRIGA = 0x0;
    // TRIGA2 0x0; 
    PG2TRIGA = 0x0;
    // TRIGA3 0x0; 
    PG3TRIGA = 0x0;
    // TRIGA4 0x0; 
    PG4TRIGA = 0x0;
    // TRIGA5 0x0; 
    PG5TRIGA = 0x0;
    // TRIGA6 0x0; 
    PG6TRIGA = 0x0;
    // TRIGA7 0x0; 
    PG7TRIGA = 0x0;
    // TRIGA8 0x0; 
    PG8TRIGA = 0x0;
    // TRIGB1 0x0; 
    PG1TRIGB = 0x0;
    // TRIGB2 0x0; 
    PG2TRIGB = 0x0;
    // TRIGB3 0x0; 
    PG3TRIGB = 0x0;
    // TRIGB4 0x0; 
    PG4TRIGB = 0x0;
    // TRIGB5 0x0; 
    PG5TRIGB = 0x0;
    // TRIGB6 0x0; 
    PG6TRIGB = 0x0;
    // TRIGB7 0x0; 
    PG7TRIGB = 0x0;
    // TRIGB8 0x0; 
    PG8TRIGB = 0x0;
    // TRIGC1 0x0; 
    PG1TRIGC = 0x0;
    // TRIGC2 0x0; 
    PG2TRIGC = 0x0;
    // TRIGC3 0x0; 
    PG3TRIGC = 0x0;
    // TRIGC4 0x0; 
    PG4TRIGC = 0x0;
    // TRIGC5 0x0; 
    PG5TRIGC = 0x0;
    // TRIGC6 0x0; 
    PG6TRIGC = 0x0;
    // TRIGC7 0x0; 
    PG7TRIGC = 0x0;
    // TRIGC8 0x0; 
    PG8TRIGC = 0x0;
    // DTL1 0x0; 
    PG1DTL = 0x0;
    // DTL2 0x0; 
    PG2DTL = 0x0;
    // DTL3 0x0; 
    PG3DTL = 0x0;
    // DTL4 0x0; 
    PG4DTL = 0x0;
    // DTL5 0x0; 
    PG5DTL = 0x0;
    // DTL6 0x0; 
    PG6DTL = 0x0;
    // DTL7 0x0; 
    PG7DTL = 0x0;
    // DTL8 0x0; 
    PG8DTL = 0x0;
    // DTH1 0x0; 
    PG1DTH = 0x0;
    // DTH2 0x0; 
    PG2DTH = 0x0;
    // DTH3 0x0; 
    PG3DTH = 0x0;
    // DTH4 0x0; 
    PG4DTH = 0x0;
    // DTH5 0x0; 
    PG5DTH = 0x0;
    // DTH6 0x0; 
    PG6DTH = 0x0;
    // DTH7 0x0; 
    PG7DTH = 0x0;
    // DTH8 0x0; 
    PG8DTH = 0x0;
    // 
    PG1CAP = 0x0;
    // 
    PG2CAP = 0x0;
    // 
    PG3CAP = 0x0;
    // 
    PG4CAP = 0x0;
    // 
    PG5CAP = 0x0;
    // 
    PG6CAP = 0x0;
    // 
    PG7CAP = 0x0;
    // 
    PG8CAP = 0x0;

}

